Берем датасет из урока 14

для столбцов Age и Balance определите:

1.размах вариации

2.среднее по выборке

3.медиану

4.стандартное отклонение

Отфильтруйте данные - выберите для анализа записи о клиентах из Германии и расчитайте те же показатели.

Сделайте выводы/предположения о содержимом датасета на основе полученных характеристик.

In [14]:
import pandas as pd
import numpy as np

In [15]:
df = pd.read_csv('Churn_Modelling1.csv', index_col = 'RowNumber')

In [59]:
df.head(10)

,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
RowNumber,,,,,,,,,,,,,
1,15634602,Hargrave,619,France,Female,42,2,0.00,1,1,1,101348.88,1
2,15647311,Hill,608,Spain,Female,41,1,83807.86,1,0,1,112542.58,0
3,15619304,Onio,502,France,Female,42,8,159660.80,3,1,0,113931.57,1
4,15701354,Boni,699,France,Female,39,1,0.00,2,0,0,93826.63,0
5,15737888,Mitchell,850,Spain,Female,43,2,125510.82,1,1,1,79084.10,0
6,15574012,Chu,645,Spain,Male,44,8,113755.78,2,1,0,149756.71,1
7,15592531,Bartlett,822,France,Male,50,7,0.00,2,1,1,10062.80,0
8,15656148,Obinna,376,Germany,Female,29,4,115046.74,4,1,0,119346.88,1
9,15792365,He,501,France,Male,44,4,142051.07,2,0,1,74940.50,0
10,15592389,H?,684,France,Male,27,2,134603.88,1,1,1,71725.73,0

In [31]:
new_table = df[['Age','Balance']]

In [32]:
#размах вар
R_v = new_table.max() - new_table.min()
R_v

Age            74.00
Balance    250898.09
dtype: float64

2.среднее по выборке

In [43]:
mean_v = new_table.mean()
mean_v

Age           38.921800
Balance    76485.889288
dtype: float64

3.медиану

In [45]:
new_table.median()

Age           37.00
Balance    97198.54
dtype: float64

стандартное отклонение

In [46]:
new_table.std()

Age           10.487806
Balance    62397.405202
dtype: float64

In [67]:
new_table_Ger = df[df['Geography'] == 'Germany'][['Balance', 'Age']].describe() 
new_table_Ger

             Balance          Age
count    2509.000000  2509.000000
mean   119730.116134    39.771622
std     27022.006157    10.519143
min     27288.430000    18.000000
25%    102800.720000    32.000000
50%    119703.100000    38.000000
75%    137560.380000    45.000000
max    214346.960000    84.000000